app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT `orders`.* FROM `orders`

  def new
    @order = Order.new
    @user_id = current_user.id  #variable para generar el hidden_field en la vista del formulario de producto
    @products = Product.all #listo los productos para el collection select
---
SELECT `products`.* FROM `products`

  def create
    @order = Order.new(order_params)
    @order.save
---
INSERT INTO `orders` (`attachment`, `created_at`, `delivery_name`, `depto`, `description`, `number`, `phone`, `product_id`, `street`, `updated_at`, `user_id`) VALUES (x'776572776572', '2015-01-12 15:54:48', 'qweqwe', 'qweqwe', 'wewer', 123123, 123123, 1, 'qweqwe', '2015-01-12 15:54:48', 1)

  def destroy
    @order.destroy
---
DELETE FROM `orders` WHERE `orders`.`id` = 2

    def set_order
      @order = Order.find(params[:id])
---
SELECT  `orders`.* FROM `orders`  WHERE `orders`.`id` = 2 LIMIT 1