app/controllers/prices_controller.rb

  def index
    @prices = Price.all
---
SELECT `prices`.* FROM `prices`

  def create
    @price = Price.new(price_params)
    @price.save
---
INSERT INTO `prices` (`created_at`, `price`, `updated_at`) VALUES ('2015-01-11 06:06:33', 40000, '2015-01-11 06:06:33')

    def set_price
      @price = Price.find(params[:id])
---
SELECT  `prices`.* FROM `prices`  WHERE `prices`.`id` = 1 LIMIT 1