app/controllers/products_controller.rb

SELECT `prices`.* FROM `prices`
---
  def new
    @product = Product.new
    @price = Price.all

SELECT `prices`.* FROM `prices`
---
  def edit
    @price = Price.all

INSERT INTO "products" ("created_at", "description", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-12-16 20:30:46.008235"], ["description", "asdasd"], ["name", "asd"], ["price", 33], ["updated_at", "2014-12-16 20:30:46.008235"]]
---
  def create
    @product = Product.new(product_params)
    @product.save